[
    {
        "text":"@Andrey Ты ИЗУЧАЕШЬ #ПРОГРАММИРОВАНИЕ не знаешь,что такое регулярное выражени?!вОТ он тож не знал,но после прочтение этого понял:)Ща Расскажу.Регулярками называются шаблоны, которые используются для поиска соответствующего фрагмента текста и сопоставления символов. Грубо говоря, у нас есть input-поле, в которое должен вводиться email-адрес. Но пока мы не зададим проверку валидности введённого email-адреса,в этой строке может оказаться совершенно любой набор символов, а нам это не нужно.Чтобы выявить ошибку при вводе некорректного адреса электронной почты, можно использовать следующее регулярное выражение: По сути, наш шаблон — это набор символов, который проверяет строку на соответствие заданному правилу."
    },

    {
        "text":"Классический текст-«рыба».в  #программирование встречается довольно часто особенно в веб-разработке он используются для создание рандомного текста так как например его использет @Святой_Георгий."
    },

    {
        "text":"Тестирование программ является неотьемлимой частью #программирование на то что функциия выполняет должное ей задачу так и не иначе @ivan"
    },

    {
        "text":"@ivan Сейчас @mahsudtop поведает о великом уме #программирование который изобрел, то чем я пользуюсь щас,не не порнохабом ,а Питоном.Гвидо ван Россум(нидерл. Guido van Rossum; род. 31 января 1956, Харлем, Нидерланды) — голландский программист, прежде всего известный как автор языка программирования Python. Среди разработчиков Python Гвидо известен как «великодушный пожизненный диктатор» проекта, что означает, что он продолжает наблюдать за процессом разработки Python, принимая окончательные решения, когда это необходимо. С июля 2018 года Гвидо ушел в постоянный отпуск от диктаторства, оставив за собой право быть обычным разработчиком."
    },

    {
        "text":"#программировани Научная статья — законченное авторское произведение, описывающее результаты @artur оригинального научного исследования (первичная научная статья) или посвящённая рассмотрению ранее опубликованных научных статей, связанных общей темой (обзорная научная статья). В первичных научных статьях авторами излагается существенная информация о проведённом исследовании в форме, позволяющей другим членам научного сообщества оценить исследование, воспроизвести эксперименты, а также оценить рассуждения и сделанные из них выводы. Обзорные научные статьи предназначены для обобщения, анализа, оценки, суммирования или синтеза ранее опубликованной информации (первичных научных публикаций). Нередко научная статья сочетает в себе эти два типа научных текстов, включая обзорную и оригинальную части."
    }
]
    
        
